package com.fatel.mamtv1;

import android.content.Context;

import java.util.ArrayList;

/**
 * Created by Administrator on 24/10/2558.
 */
public class PostureCollection {

    private static PostureCollection instance = null;
    private ArrayList<Posture> collection = new ArrayList<>();
    private static int count=0;
    private PostureCollection(){

    }
    public static PostureCollection getInstance(Context context){
        if (instance == null) {
            instance = new PostureCollection();
            instance.initial(context);
        }
        return instance;
    }

    public void addImage(int image,String description,int mode,Context context){
        Posture posture = new Posture(count,image,description,mode);
        posture.save(context);
        collection.add(posture);
        count++;
    }

    public void initial (Context context){
        if(Posture.getPostureCount(context)<13) {
            addImage(R.drawable.pos1_1, "เริ่มต้นจากตามองตรง แล้วหมุนคอไปด้านขวามือช้า ๆ แล้วหมุนกลับที่เดิม จากนั้นหมุนคอไปทางซ้ายมือแล้วหมุนกลับที่เดิม ทำสลับซ้าย/ขวา จนครบ 4 รอบ",1,context);
            addImage(R.drawable.pos1_2, "เริ่มจากหน้าตรงตามองไปข้างหน้า แล้วค่อยๆเอียงคอไปทางขวามือแล้วกลับมาอยู่ในท่าเดิม จากนั้นค่อย ๆ เอียงคอไปทางซ้ายมือแล้วกลับมาอยู่ในท่าเดิมอีกครั้ง (ระวังอย่าให้คอเหยียดตึงจนเกินไป) ทำสลับซ้าย/ขวา จนครบ 4 รอบ",1, context);
            addImage(R.drawable.pos1_3, "เริ่มจากท่านั่งศีรษะตรง ค่อย ๆ ก้มศีรษะลงไปข้างหน้าเก็บคาง แล้วเงยหน้าขึ้นอยู่ในท่าเริ่มต้น ใช้แขนข้างใดข้างหนึ่งหรือทั้งสองข้างวางที่หลังต้นคอ ค่อย ๆ เงยหน้าขึ้นให้ศีรษะเอนไปทางด้านหลัง แล้วก้มหน้าลงมาอยู่ในท่าเดิม (ระวังอย่าให้ศีรษะเอนไปทางด้านหลังมากเกินไป)",1, context);
            addImage(R.drawable.pos2_1, "ให้พับไหล่ทั้งสองข้างไปด้านหลังแล้วยกขึ้นก่อนที่จะหมุนไหล่ไปข้างหน้า ทำซ้ำแบเดิม 8 ครั้ง แล้วเปลี่ยนเป็นพับไหล่ไปด้านหน้า ยกไหล่ขึ้นก่อนที่จะหมุนเป็นวงกลม ทำซ้ำแบบเดิม 8 ครั้ง",2, context);
            addImage(R.drawable.pos2_2, "วางมือขวาลงบนไหล่ซ้ายขณะที่ศอกขวายกขึ้นขนานกับพื้น ใช้มือซ้ายดึงศอกขวาเข้าหาตัว จากนั้นกลับไปท่าเริ่มต้นโดยเปลี่ยนข้าง ทำสลับซ้ายขวา",2,context);
            addImage(R.drawable.pos3_1, "พับไหล่ไปด้านหน้าให้มากที่สุดเท่าที่จะทำได้ แล้วดึงไหล่กลับมาอยู่ในท่าเดิม จากนั้นก็ยืดและดึงอกไปด้านหลัง ทำซ้ำแบบเดิม 8 ครั้ง",3, context);
            addImage(R.drawable.pos3_2, "ยืนตัวตรงโดยให้มือทั้งสองข้างวางตรงบริเวณเอวหรือสะโพก ดึงแขนทั้งสองข้างไปด้านหลัง ทำซ้ำแบบเดิม 8 ครั้ง",3, context);
            addImage(R.drawable.pos3_3, "มือจับบริเวณขอบเก้าอี้หลังตรงแนบกับพนักเก้าอี้ ยกเข่าซ้ายและขวาขึ้นทำสลับกัน 4 รอบ",3, context);
            addImage(R.drawable.pos3_4, "ให้ยืนหลังตรงและจับพนักเก้าอี้เพื่อช่วยในการทรงตัวที่ยกเข่าซ้ายขึ้นให้สูงที่สุดเท่าที่จะทำได้ ลดขาลงแล้วเหยียดไปด้านหลัง ทำซ้ำแบบเดิม 8 ครั้ง แล้วเปลี่ยนไปทำอีกข้างในจำนวนที่เท่ากัน",3, context);
            addImage(R.drawable.pos3_5, "เริ่มจากท่านั่งเก้าอี้ ค่อย ๆ เหยียดตัวบนพนักเก้าอี้  ยืดแขนทั้งสองข้างขึ้นไปเหนือศีรษะ เหยียดไปทางด้านหลัง จนศีรษะและแผ่นหลังส่วนบนยืดออกไปจนสุด โดยเท้าทั้งสองข้างติดกับพื้น ",3, context);
            addImage(R.drawable.pos4_1, "ยกแขนขึ้นทั้งสองข้างแล้วหมุนข้อมือเข้าหาตัว 8 ครั้ง จากนั้นหมุนข้อมือออกจากตัว 8 ครั้ง",4, context);
            addImage(R.drawable.pos4_2, "ยกแขนขึ้นทั้งสองข้างแล้วหมุนข้อมือเข้าหาตัว 8 ครั้ง จากนั้นหมุนข้อมือออกจากตัว 8 ครั้ง",4, context);
            addImage(R.drawable.pos4_3, "ยืดแขนขวาออกไประดับไหล่โดยให้ฝ่ามือหันออกจากตัว ใช้มือซ้ายดึงปลายมือขวาเข้าหาตัวช้า ๆ แล้วปล่อยกลับไปอยู่ท่าเดิม จากนั้นพลิกฝ่ามือคว่ำลงแล้วดึงปลายมือซ้ายเข้าหาตัวช้า ๆ แล้วปล่อยมือกลับไปอยู่ในท่าเดิม เปลี่ยนไปทำอีกข้างแบบเดียวกันตั้งแต่เริ่มตัน",4, context);
            addImage(R.drawable.pos5_1, "ให้ยืนแยกเท้างอเข่าเล็กน้อย งอแขนขึ้นให้ข้อศอกขนานกับพื้นแล้วบิดตัวไปทางซ้ายมือก่อนแล้วจึงบิดตัวหมุนไปทางขวามือ ทำซ้ำแบบเดิม 4 รอบ",5, context);
            addImage(R.drawable.pos5_2, "เริ่มจากท่านั่งบนเก้าอี้วางมือซ้ายลงที่ต้นขายืดแขนขวาขึ้นเหนือศีรษะ แล้วเอียงตัวช้า ๆ ไปทางซ้ายแล้วดึงกลับมาอยู่ในท่าเดิม เปลี่ยนข้างจากซ้ายเป็นขวาแล้วทำแบบเดิมตั้งแต่ต้น ",5, context);
            addImage(R.drawable.pos6_1, "วางมือลงบนเก้าอี้หรือบนโต๊ะแล้วเหวี่ยงขาที่เหยียดตรงไปด้านหน้าและหลังสลับกัน 8 ครั้ง แล้วเปลี่ยนข้างทำแบบเดิมตั้งแต่ต้นจนครบ 8 ครั้ง",5, context);
            addImage(R.drawable.pos6_2, "เริ่มจากนั่งบริเวณขอบเก้าอี้ด้านหน้า เหยียดเท้าซ้ายไปข้างหน้าให้สันเท้าแตะพื้นปลายเท้าชี้ขึ้น รักษาแผ่นหลังให้เหยียดตรงโดยให้มือหรือศอกขวาวางพักไว้บนขาขวา ใช้มือซ้ายไว้เบา ๆ แล้วเลื่อนลงไปที่ปลายเท้าช้า ๆ แล้วดึงกลับมาอยู่ในท่าเดิม จากนั้นสลับขาเปลี่ยนไปทำอีกข้าง",6, context);
            addImage(R.drawable.pos6_3, "ยืนตัวตรง มือจับขอบโต๊ะหรือพนักเก้าอี้ ใช้มือซ้ายดึงขาขวาขึ้นโดยที่ต้นขาอยู่ในท่าตั้งตรง ปล่อยขาขวาลงสลับข้างเปลี่ยนขาเริ่มขั้นตอนแรกใหม่",6, context);
            addImage(R.drawable.pos6_4, "ให้ยกสันเท้าขึ้นจากพื้น ปลายเท้าชี้ ขึ้น/ลง สลับกันจำนวน 8 รอบ จากนั้นสลับขาเปลี่ยนไปทำอีกข้าง",6, context);
            addImage(R.drawable.pos6_5, "จับพนักเก้าอี้หรือขอบโต๊ะยืนด้วยขาข้างเดียว ยกเท้าอีกข้างขึ้น ขยับปลายเท้าขึ้น/ลง 8 รอบ จากนั้นสลับขาเปลี่ยนไปทำอีกข้าง",6, context);
            addImage(R.drawable.pos6_6, "ยืนตัวตรง มือจับพนักเก้าอี้หรือขอบโต๊ะด้วยมือเดียวหรือสองมือ ค่อย ๆ เหยียดขางข้างใดข้างหนึ่งไปด้านหลังโดยให้ปลายเท้าชี้ไปด้านหน้า ดึงขากลับมาอยู่ในท่าเดิม สลับขาแล้วเปลี่ยนไปทำอีกข้าง",6, context);
            addImage(R.drawable.pos6_7, "ยืนโดยใช้มือข้างใดข้างหนึ่งจับพนักเก้าอี้หรือขอบโต๊ะเอาไว้ ยกเท้าข้างหนึ่งขึ้นแล้วหมุนข้อเท้า เข้า/ออก เป็นวงกลม 8 รอบ จากนั้นสลับขาแล้วเปลี่ยนไปทำอีกข้างเท่า ๆ กัน",6, context);
            addImage(R.drawable.pos6_8, "ให้ยกสันเท้าทั้งสองข้างขึ้นแล้วหมุนข้อเท้าเข้าเป้นวงกลม 8 รอบ จากนั้นเปลี่ยนเป็นหมุนข้อเท้าออกเป็นวงกลมเช่นกัน 8 รอบ ",6, context);

        }
        else{
            for(int i=0;i<Posture.getPostureCount(context);i++){
                Posture posture=Posture.find(i,context);
                collection.add(posture);
            }

        }

    }
    public int size(){
        return collection.size();
    }
    public Posture getPosture(int id){
        return collection.get(id);
    }
    public ArrayList<Posture> getPosture(int[] id){
        ArrayList<Posture> imgcoll = new ArrayList<>();
        for (int i=0;i<id.length;i++){
            imgcoll.add(collection.get(id[i]));
        }
        return imgcoll;
    }
    public ArrayList<Posture> getPostureMode(int mode,Context context){
        ArrayList<Posture> imgcoll = Posture.findMode(mode,context);
        return  imgcoll;

    }




}
